testdata/requests/owa_applyconversationaction_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
    <soap:Header>
        <t:RequestServerVersion Version="Exchange2013"/>
        <t:TimeZoneContext>
            <t:TimeZoneDefinition Id="Eastern Standard Time"/>
        </t:TimeZoneContext>
    </soap:Header>
    <soap:Body>
        <m:ApplyConversationAction>
            <m:ConversationActions>
                <t:ConversationAction>
                    <t:Action>SetReadState</t:Action>
                    <t:ConversationId Id="aaaaaaa"/>
                    <t:IsRead>true</t:IsRead>
                    <t:SuppressReadReceipts>true</t:SuppressReadReceipts>
                    <t:ConversationLastSyncTime>2017-06-21T13:13:11.000</t:ConversationLastSyncTime>
                    <t:ContextFolderId>
                        <t:DistinguishedFolderId Id="inbox"/>
                    </t:ContextFolderId>
                </t:ConversationAction>
            </m:ConversationActions>
        </m:ApplyConversationAction>
    </soap:Body>
</soap:Envelope>